#
# installation of dotfiles and configuration through homebrew
# each list is in alphabetical order
# Felos9001
# 
# **CONTENTS**
# 1. Taps
# 2. Binaries
# 3. Font
# 4. cask apps
# 5. mac apps
#

#--------------------------------------------------------

# **TAPS**
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

#--------------------------------------------------------
# **BINARIES** 
brew 'amass' #In-depth Attack Surface Mapping and Asset Discovery
brew 'dalfox' #powerful open-source XSS scanner and utility focused on automation.
brew 'duti' #Select default apps for documents and URL schemes on macOS
brew "geckodriver" #WebDriver <-> Marionette proxy
brew "ghq" #Remote repository management made easy
brew 'httpie' #User-friendly cURL replacement (command-line HTTP client)
brew 'mas' # Mac App Store manager
brew "neovim" #Ambitious Vim-fork focused on extensibility and agility
brew "node@14" #Platform built on V8 to build network applications

#--------------------------------------------------------

# **FONTS** 
cask "font-hack-nerd-font" #Developer targeted fonts with a high number of glyphs

#--------------------------------------------------------

# **CASK APPS**
cask 'burp-suite' #Web security testing toolkit
cask 'docker' #Pack, ship and run any application as a lightweight container
cask 'hammerspoon' #Desktop automation application
cask 'kap' #Open-source screen recorder built with web technology
cask 'keycastr' # Open-source keystroke visualizer
cask 'proxyman' #HTTP debugging proxy
cask "obsidian" #Notes app that works on top of a local folder Markdown files
cask 'raycast' #Control your tools with a few keystrokes
cask 'stats' #System monitor for the menu bar
cask 'tableplus' #Native GUI tool for relational databases
cask 'telegram' #Messaging app with a focus on speed and security
cask 'tor-browser' #Web browser focusing on security
cask 'visual-studio-code' #code editor redefined and optimized for building and debugging 
cask 'warp' #Terminal emulator as alternative to Apple's Terminal app

#--------------------------------------------------------

# **MAC APPS**
# mas '', id:
mas 'Step Two', id: 1448916662 #two factor authentication
mas 'Trello', id: 1278508951 #Organize anything, together  


