jorgebucaran/fisher
edc/bass
oh-my-fish/theme-bobthefish
patrickf1/colored_man_pages.fish
franciscolourenco/done
oh-my-fish/plugin-grc
jorgebucaran/nvm.fish
oh-my-fish/plugin-pj
markcial/upto
